{
    "basics": {
        "name": "Brendan Cazier",
        "label": "Mechanical Engineer",
        "email": "***REMOVED***",
        "phone": "+1 ***REMOVED***",
        "website": "https://thecaziers.com",
        "summary": "I'm a mechanical engineer by education, having spent all of my early career working with  physical problems associated with aircraft maintenance and reliability. Originally I used coding as a hobby and to try to automate various tasks either at work or at home, but I'm now looking to turn that into my profession. I have worked on both long-term, large-scope, campains, as well as high urgency, triage-esque, projects. I enjoy problem solving, and have worked to provide solutions while conscious of labor difficulties, costs, reliability and regulatory requirements, and more.",
        "location": {
            "address": "2803 E 1st Pl",
            "postalCode": "OK 74104",
            "city": "Tulsa",
            "countryCode": "US",
            "region": "Oklahoma"
        },
        "profiles": [
            {
                "network": "Github",
                "username": "cazier",
                "url": "https://github.com/cazier"
            },
            {
                "network": "Gitea",
                "username": "bcazier",
                "url": "https://git.cazier.xyz/bcazier"
            }
        ]
    },
    "work": [
        {
            "company": "American Airlines",
            "position": "Coop Engineer",
            "website": "https://www.aa.com",
            "startDate": "2012-05-28",
            "endDate": "2013-01-11",
            "summary": "Extended Internship Program in Narrowbody Systems Project Engineering",
            "highlights": [
                "Focused primarily on Boeing B737-NG and MD80 Fleets",
                "Revised technical documentation, ensuring compliance to FAA, CFR, and OEM regulations.",
                "Designed and prototyped a drop-in air filtration system for the B737-NG and B757, and began fleet implementation",
                "Benchmarked fleetwide reliability improvements to minimize in-service cancellations and in-flight issues",
                "Developed Maintenance procedures for all fleets, specifically focused on Nitrogen Generation System, Landing Gear, and Fuel Management systems."
            ]
        },
        {
            "company": "SWECO - MI SWACO, A Schlumberger Company",
            "position": "CAD Modeller",
            "website": "https://www.slb.com/companies/m-i-swaco",
            "startDate": "2011-05-30",
            "endDate": "2011-08-12",
            "summary": "SWECO is an American oilfield services manufacturer of industrial filtration devices for seperating solids and fluids",
            "highlights": [
                "Summer Internship, modelling hydraulic components for shaker devices in Solidworks",
                "Replaced a catalog of individual models with parametrically-generated designs allowing for on-the-fly creation of new and customized parts",
                "Worked alongside technicians to create an instrument cabinet system to store manifold prototypes",
                "Developed, and prototyped, a training program for combining the individual components to full oilfield assemblies to demonstrate sales capabilities"
            ]
        }
    ]
}