{
    "basics": {
        "name": "Brendan Cazier",
        "label": "Mechanical Engineer",
        "email": "***REMOVED***",
        "phone": "***REMOVED***",
        "website": "https://thecaziers.com",
        "summary": "A mechanical engineer by education, having spent all of my early career fixing physical problems in aircraft maintenance and reliability. I've often used coding as a hobby and to try to automate various tasks either at work or at home, but I'm now looking to turn that into my profession. I have worked on both long-term, large-scope, campaigns, as well as high urgency, triage-esque, projects. I enjoy problem solving, and have worked to provide solutions while conscious of labor difficulties, costs, reliability and regulatory requirements, and more.",
        "location": {
            "address": "2803 E 1st Pl",
            "postalCode": "OK 74104",
            "city": "Tulsa",
            "countryCode": "US",
            "region": "Oklahoma"
        },
        "profiles": [
            {
                "network": "Github",
                "username": "cazier",
                "url": "https://github.com/cazier"
            },
            {
                "network": "Gitea",
                "username": "bcazier",
                "url": "https://git.cazier.xyz/bcazier"
            }
        ]
    },
    "education": [
        {
            "institution": "Rensselaer Polytechnic Institute",
            "area": "Mechanical Engineer",
            "studyType": "Bachelor",
            "startDate": "2010-08",
            "endDate": "2014-12",
            "courses": [
                "CSCI-1100 - Computer Science I",
                "CSCI-1190 - Beginning C Programming for Engineers",
                "ENGR-2350 - Embedded Control",
                "ENGR-4300 - Electronic Instrumentation"
            ]
        }
    ],
    "work": [
        {
            "company": "American Airlines",
            "position": "Engineering - Internship",
            "website": "https://www.aa.com",
            "startDate": "2013-06-03",
            "endDate": "2013-08-16",
            "summary": "Returning Summer Internship in Boeing Systems Project Engineering",
            "highlights": [
                "Expanded fleet scope to include Boeing B757 and B767 Fleets",
                "Created an Excel VBA \"Program\" to provide aircraft leasors of B757s with generated reports of Electrical Load and Structural Modification data",
                "Developed Maintenance procedures, specifically focused on Fire Suppression, and Oxygen Generation systems, and Corrosion Prevention and Control (CPCP) Program",
                "Tracked MD80 Cockpit window pane, frame, and seal temperature exposure in an effort to reduce unneeded part replacement and save on parts, labor, and cost"
            ]
        },
        {
            "company": "American Airlines",
            "position": "Engineer - Coop Program (Long-term Internship)",
            "website": "https://www.aa.com",
            "startDate": "2012-05-28",
            "endDate": "2013-01-11",
            "summary": "Extended Internship Program in Narrowbody Systems Project Engineering",
            "highlights": [
                "Primarily focused on the Boeing B737-NG and MD80 Narrowbody Fleets",
                "Revised technical documentation, ensuring compliance to FAA, CFR, and OEM regulations, to incorporate reliability and ease of maintenance changes",
                "Created a folio to demonstrate B737-NG Nitrogen Generation System Maintenance schedule and requirements to Senior Management and regulatory agencies.",
                "Designed and prototyped a drop-in air filtration system for the B737-NG and B757, working with outside vendor groups for manufacturing and airflow testing, and implemented across fleets, in excess of 500 aircraft",
                "Analyzed frequently reported maintenance issues to evaluate the possibility of extending the maintenance intervals by 50%",
                "Developed Maintenance procedures for all fleets, specifically focused on Nitrogen Generation System, Landing Gear, and Fuel Management systems"
            ]
        },
        {
            "company": "SWECO - MI SWACO, A Schlumberger Company",
            "position": "CAD Drafter - Internship",
            "website": "https://www.slb.com/companies/m-i-swaco",
            "startDate": "2011-05-30",
            "endDate": "2011-08-12",
            "summary": "SWECO is an American oilfield services manufacturer of industrial filtration devices for separating solids and fluids",
            "highlights": [
                "Replaced catalog of approximately 4000 individual hydraulic component models with parametrically-generated designs and frameworks, allowing for on-the-fly creation of parts",
                "The parametric generation approach resulted in ~75% decrease in storage requirements and 3x speed increase, while also providing the funcionality of creating individually customizable models",
                "Developed and offered a training program for combining the individual components to create full oilfield assemblies to demonstrate sales capabilities"
            ]
        }
    ],
    "languages": [
        {
            "language": "English",
            "fluency": "Native Speaker"
        },
        {
            "language": "Spanish",
            "fluency": "Native Speaker"
        },
        {
            "language": "German",
            "fluency": "Intermediate"
        },
        {
            "language": "Russian",
            "fluency": "Beginner"
        }
    ],
    ]
}